# TerminationExtensionLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TerminationExtensionLength Property
ParameterTypeId Class See Also
---
"Extension Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TerminationExtensionLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TerminationExtensionLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TerminationExtensionLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace